Repository: juanwolf/django_juanwolf.fr
Catalog: juanwolf_*/conf/locale/*/LC_MESSAGES/django.po
Languages: fr

source: categories
fr: Catégories

source: There's no post in this category for the moment
fr: Il n'y a pas d'article pour cette catégorie pour le moment

source: All our engineers are working on it. We'll fix this problem soon.
fr: Nos ingénieurs sont en train de plancher dessus. Ce problème sera résolu rapidement.

source: Home
fr: Accueil

source: juanwolf's blog
fr: Blog de juanwolf

source: A blog about Software Engineering, video-games
fr: Un blog sur la conception logicielle et ses outils ainsi que sur les jeux-vidéos

source: Category:
fr: Catégorie :

source: Thanks for reading this article ! Don't hesitate to leave your opinion in the section bellow or if you feel generous here's my
fr: Merci d'avoir lu cet article ! N'hésitez pas à laisser votre avis dans les commentaires ci-dessous ou si vous vous sentez généreux et prêt à être gracieusement remercié de ma part, voici mon

source: Please enable JavaScript to view the
fr: Veuillez activer JavaScript pour voir les

source: comments powered by Disqus.
fr: Commentaires fournis par Disqus.

source: comments powered by
fr: Commentaires fournis par

source: Previous post
fr: Article précédent

source: Next post
fr: Article suivant

source: HEY, WHAT ARE YOU DOING HERE ?!!
fr: HEY, QU'EST QUE TU FAIS ICI ?!!

source: My pandas are watching you
fr: Mes pandas vous regardent.

source: My pandas saw you going to a bad URL, it's ok for this time but try not to do it again.
fr: Mes pandas vous ont vu vous rendre sur une mauvaise URL, ça ira pour cette fois mais que ça ne se reproduise pas.

source: There's no post for the moment
fr: Il n'y a pas d'article disponible pour le moment

source: Newer posts
fr: Nouveaux articles

source: Older posts
fr: Anciens articles

source: Preview Image for the article :
fr: Image d'affiche pour l'article :

source: Read this post
fr: Lire cet article

source: There's no post for this tag for the moment
fr: Il n'y a pas d'article lié à ce tag pour le moment

source: RSS feed - posts
fr: Flux RSS - Articles

source: RSS feed - blog posts
fr: Flux RSS - Articles du blog

source: About
fr: À propos

source: Where are you ?
fr: Où êtes-vous ?

source: Welcome to my own website. You'll be able to find my resume, a blog where I'll put technical reviews (software engineering...) and video games posts. Soon, you'll be able to find a chat which gives you the possibility to talk with me (awesome isn't it?). The chat section has been written in node.js and gave me an introduction to this new technology at the time (2014). Now I want to make it again using django channelsi and remoteStorage so I can have a uniform environment using django and you can even use this application and host your own data.
fr: Bienvenue sur mon propre site. Vous trouverez au sein de ce site, mon cv, mon blog où je posterai des revues techniques (ingénierie logicielle, ...) ainsi que des articles sur les jeux vidéo que j'aurai testé. Dans peu de temps vous trouverez une section chat qui nous permettra de discuter. Génial, n'est-ce pas?Le chat a été écrit en node.js et m'a donné une bonne introduction à la technologie en 2014. Maintenant je veux refaire cette section en utilisant django channels pour tester et vous faire un retour quand j'aurais fini ! J'aimerai mixer django channels avec remoteStorage.io afin que tout le monde puisse utiliser l'application et stocker ses propresdonnées.

source: Who am I?
fr: Qui suis-je ?

source: I'm Jean-Loup Adde (thanks to ask). I'm a %(age)s year old python / django developer at Airinov. If you want to know more about me, I invite you to the <a href="%(resume)s">resume section</a>
fr: Je suis Jean-Loup Adde (merci de le demander). Je suis un développeur logiciel de %(age)s ans. Si vous voulez en savoir plus sur moi, je vous invite à vous rendre à la <a href="%(resume)s">section CV</a>

source: Why make this website?
fr: Pourquoi créer ce site ?

source: I wanted to make my own website first to find a internship for my end of studies (master degree in software engineering (2015)) but also to use the blog to put the stuff that I struggled to do and share it to the internet, etc... All my work is under
fr: Je voulais créer mon propre site internet pour trouver un stage à l'époque où j'étais encore étudiant (2015) mais aussi pour utiliser cette plateforme afin de partager toutes les difficultés que j'ai eu durant mes projets personnels. Mon travail est sous

source: If you want to contribute, please feel free to contact me if you have any idea of a blog post or to give a little tip with
fr: Si vous voulez contribuer à ce merveilleux projet, n'hésitez pas à me contacter ou m'envoyer des millions de sims flouz avec

source: What did I use to make it?
fr: Qu'ai-je utilisé pour faire ce site ?

source: Server
fr: Serveur

source: General
fr: Général

source: the outdated one
fr: l'ancien

source: Jean-Loup Adde's website
fr: Le site de Jean-Loup Adde

source: Welcome dear Websurfer !
fr: Bienvenue cher surfeur de la toile !

source: I'm Jean-Loup Adde, a %(age)s year old software developer at <a href="http://www.claranet.co.uk">Claranet</a>. I have a crush on all the technologies around the web. That's why my website is kinda of a patchwork of technology. For example the chat section uses node.js (it's down for the moment for security issues), the blog section uses django, I'll not list them all. I really enjoyed making this website and I have written everything that I have used to make this website on the <a href="https://about.juanwolf.fr">'About' section</a>. If you are interested and have any questions about anything or just to say hi do not hesitate to send me a message or a little tweet, I will appreciate it!
fr: Bonjour !!! Je suis Jean-Loup Adde, jeune développeur web (Python/Django) de %(age)s ans chez <a href="http://www.claranet.co.uk">Claranet</a>.J'ai une grande passion pour toutes les technologies autour du web, dév logiciel, intégration continue. D'ailleurs mon site est en quelques sortes mon laboratoire pour tester ces nouvelles technologies. Le chat est en node.js (qui n'est pas disponible due à quelques failles de sécurité), le blog est en django, tout ça relié à un jenkins pour déployer chaque nouvelle feature, etc... Si vous voulez en savoir plus sur les technologies utilisées, la section 'à propos' est là pour répondre à toutes vos questions !

source: This website is totally free and will never use adverts to make profits. If you want to contribute of the survey of this website, I created a <a target="_blank"href="https://flattr.com/submit/auto?user_id=juanwolf&url=https://juanwolf.fr/en/&title=juanwolf.fr&description=Jean-Loup Adde's website&language=en_GB&tags=programming&category=text">Flattr account</a>, but you can also participate giving me articles ideas or video games to try !
fr: De plus, ce site est totalement gratuit et ne contiendra JAMAIS de publicités. Si jamais vous l'avez aimé et que vous aimeriez participer à ce projet, j'ai ouvert un <a target="_blank"href="https://flattr.com/submit/auto?user_id=juanwolf&url=https://juanwolf.fr/en/&title=juanwolf.fr&description=Jean-Loup Adde's website&language=en_GB&tags=programming&category=text">Flattr</a>, vous permettant de contribuer financièrement à la survie du site. Mais vous pouvez aussi contribuer en me donnant des idées de jeux à tester ou des idées d'articles à rédiger.

source: The chat is not available for the moment (coming soon, hopefully). Currently, on this (awesome) website, you will be able to find:
fr: Le chat n'est pas disponible pour le moment (je suis à la traine :S). Vous pourrez trouver sur ce (magnifique) site :

source: My blog
fr: Mon blog

source: My resume
fr: Mon CV

source: Resume
fr: CV

source: Jean-Loup Adde's resume
fr: Le CV de Jean-Loup Adde

source: About me
fr: À propos

source: Education
fr: Cursus

source: Projects
fr: Projets

source: Skills
fr: Compétences

source: Languages
fr: Langues

source: Activities
fr: Activités

source: Jean-Loup giving an introduction of the django framework at Codeurs En Seine in Rouen.
fr: Jean-Loup donnant une introduction au framework django à Codeurs En Seine

source: Software developer
fr: Développeur Logiciel / Web

source: Hello, my name is Jean-Loup Adde and I am a %(age)s year old System developer at Claranet. I love experimenting and using new technologies around software and web development. I'm quite a passionate to make life easier for users but aswell for developers and that's why I'm huge fan of continuous intgeration and automatization. You can contact me at <a href="mailto:juanwolf@juanwolf.fr">jean-loup.adde@juanwolf.fr</a>.
fr: Bonjour, je suis Jean-Loup Adde, développeur logiciel de %(age)s ans. Je suis actuellement embauché chez Claranet en tant que développeur système.N'hésitez pas à me contacter à cette adresse : <a href="mailto:jean-loup.adde@juanwolf.fr">jean-loup.adde@juanwolf.fr</a>.

source: Where have I studied ?
fr: Qu'ai-je étudié ?

source: Master degree in software development at the University of Rouen (2013-2015)
fr: Master Génie Informatique Logicielle à l'université de Rouen (2013-2015)

source: Modules studied: C++, .NET, JEE, semantic web, web security, relational database, web languages 2 (XML and technologies around it), data mining and learning, projects management, code theory, UML, distributed computing.
fr: Sujets appris : Langages web 2 (XML et technologies associées), fouille de données et apprentissage, gestion de projets, théorie des codes, UML, architectures distribuées, technologies .NET (MVC.NET), JEE, intelligences artificielles, web sémantique, programmation orienté aspect, C++, busisness intelligence.

source: Erasmus exchange at the University of Valladolid (Spain) (2013-2014)
fr: Échange Erasmus à l'université de Valladolid (Espagne) (2013-2014)

source: Modules studied: UML, software quality, android, projects management, parallel computing.
fr: Sujets appris : UML, qualité logicielle, android, gestion de projets, programmation parallèle

source: BSc degree in computer science at the University of Rouen (2010-2013)
fr: Licence Informatique à l'université de Rouen (2010-2013)

source: Modules studied: Web languages (XHTML, CSS, PHP, JS), MMI, OOP, network programming, system programming, algorithmic, infographism, languages theory, graph theory, databases administration, communication
fr: Sujets appris : Langages web (XHTML, CSS, PHP, JS), IHM, POO, programmation réseaux, programmation système, algorithmique, infographie, théorie des languages, théorie des graphes, base de données, communication

source: Where have I worked?
fr: Où ai-je travaillé ?

source: Python / Django developer at Airinov
fr: Développeur Python / Django à Airinov

source: Developing on an existing application used by client to follow their orders. Developing an internal application to inspect multiple datas in the database and building a REST API.
fr: Développement d'une interface client pour la visualisation des commandes. Développement d'une application interne permettant d'inspecter un regroupement d'informations en base et construction d'une API REST.

source: Notions viewed: Python 2.7, django, django rest framework, celery, factory-boy, js, jQuery, bootstrap, AWS, PostgreSQL, git.
fr: Technologies utilisées : Python 2.7, django, django rest framework, celery, js, jQuery, bootstrap, AWS.

source: Software Developer internship at Masternaut
fr: Stage Développeur / Testeur à Masternaut

source: Creation of an application which is connected to an elasticsearch and create automatically scenarios (simulations) to test performances of an REST API.<br> Creation of functionnalities on an existing project written in groovy.<br>Creation of a service which replicate in real-time data from a MySQL database to an elasticsearch (python 3).
fr: Création d'une application qui se connecte à un elastic search et créé automatiquement un scénario / simulation à partir du json récupéré afin de tester les performances d'une API REST backoffice.<br>Développement de modules et de fonctionnalités sur un projet existant depuis plusieurs années développé en groovy.<br>Développement d'un service permettant la réplication des données en temps réel d'une base MySQL à un Elasticsearch (projet écrit en python).

source: Notion viewed: Scala, Gatling, Java 8, JUnit, Elasticsearch, Python, Jenkins, Sonar, Graphite, Grafana, Bash, Git, GitBlit
fr: Technologies utilisées : Scala, Gatling, Java 8, JUnit, Elasticsearch, Python, Jenkins, Sonar, Graphite, Grafana, Bash, Git, GitBlit

source: Webmaster internship for the city of Rouen
fr: Stage Webmaster pour la ville de Rouen

source: Creation of a portail for 2013 summer manifestations at the city of Rouen. In charge of the front-end development of the portal and the content management with Drupal 6.
fr: Création d'un portail pour les manifestations estivales de 2013 au sein de la ville de Rouen. Chargé du développement front-end du portail et de la gestion du contenu avec Drupal 6.

source: Notions viewed: PHP, CSS, HTML, SASS, unix system, web management, responsive web design, Drupal 6, Drupal theming, Git
fr: Notions vues : PHP, CSS, HTML, SASS, système unix, gestion de contenu web, responsive web design, Drupal 6, Drupal theming, Git

source: What have I made?
fr: Qu'ai-je créé ?

source: Personal
fr: Personnel

source: My own website, <a href='https://juanwolf.fr'>juanwolf.fr</a>, where you currently find yourself and have the pleasure to browse. This project contains the resume, the portal, the responsive menu and the 404 page.
fr: Mon propre site internet où vous avez le plaisir d'être. Il contient mon CV, le portail entre les différentes catégories, le menu responsive ainsi que la page 404 (Regroupement des fichiers statiques de juanwolf.fr).

source: Hooks for git to block every commit that doesn't match the standard choosed by the syntax requirements of the projects. Hooks are available for python with pep8 and for javascript with jshint.
fr: Hooks pour git permettant de bloquer chaque commit ne respectant pas les standards syntaxiques choisis. Ces hooks sont disponibles pour python (pep8) et javascript (jshint).

source: Technologies used: Bash, git.
fr: Technologies utilisées : Bash, git.

source: Router created for the language switch and management for juanwolf.fr. The language management follows the W3C requirements (cookie and autodetection with the HTTP header).
fr: Routeur créé pour la détection et la gestion de langage pour juanwolf.fr. La gestion de la langue suit les recommandations W3C qui sont de détecter premièrement la langue préférée avec l'entête HTTP puis sauvegarder la langue au sein d'un cookie s'il change de langage.

source: Technologies used: Golang, javascript, git
fr: Technologies utilisées : Golang, JS, git

source: A blog where I write my own technical reviews and video games articles.
fr: Blog où seront mes articles techniques ainsi que les articles sur les jeux-vidéos que j'aurai testé.

source: Technologies used: Python, Django, PostgreSQL, HTML5, CSS3, SASS, jQuery 1.11, Git, Gatling, Jenkins, Travis, Gitlab CI, Grunt, Bower
fr: Technologies utilisées : Python, Django, HTML5, CSS3, SASS, JQuery 1.11, Git, Gatling, Jenkins, Gitlab CI, Grunt, Bower

source: A chat where you can talk with me (unbelievable I know).
fr: Un chat où vous pouvez tergivercer avec moi (incroyable n'est ce pas ?).

source: Technologies used: javascript, node.js, socket.io, nodemailer, express.js, HTML5, desktop notifications, CSS3, SASS, jQuery 1.11, git.
fr: Technologies utilisées: javascript, node.js, socket.io, nodemailer, express.js, HTML5, desktop notifications, CSS3, SASS, jQuery 1.11, git

source: A ionic 2 application retrieving informations from the REST API of the blog.
fr: Une application ionic 2 récupérant les informations depuis l'API REST du blog.

source: Technologies used: Ionic 2, AngularJS 2, SASS, CSS3, SASS, Git
fr: Téchnologies utilisées: Ionic 2, AngularJS 2, SASS, CSS3, SASS, Git

source: Blog application for <a href='http://www.codeursenseine.com/' target='_blank'>Codeurs En Seine 2015</a>
fr: Mini blog pour<a href='http://www.codeursenseine.com/' target='_blank'>Codeurs En Seine 2015</a>

source: Little django application live coded during the presentation <a target='_blank' href='http://www.codeursenseine.com/2015/speakers.html#orateur-14' target='_blank'>'django introduction' in Codeurs En Seine 2015</a>
fr: Petite application django réalisée dans le cadre de la présentation <a target='_blank' href='http://www.codeursenseine.com/2015/speakers.html#orateur-14' target='_blank'>'introduction à django'</a> à Codeurs En Seine 2015

source: Technologies used: HTML5, Bootstrap, git, django, reveal.js
fr: Technologies utilisées: HTML5, Bootstrap, git, django, reveal.js

source: University
fr: Universitaire

source: Project joining together all the promotion (33 students) 2014/2015 of the GIL Master degree divided in 5/6 students team. I have been supervising two team. Before to start the project I gave a git formation to the promotion (<a href="http://blog.juanwolf.fr/media/Formation%%20Git.pdf">slides in french</a>). During the project, I installed a whole software factory (Jenkins, Maven, Tomcat, Nexus, Apache). I developed a "Service Checker" for Tomcat to know the state of the different web services in the Tomcat developed with Valentin Jouanigot. I also developed few scripts to automatise the steps to pass the project to the production environment. I have been in charge of the servers and the production stability and I made a feedback article of the project <a href="https://blog.juanwolf.fr/programming/drums-my-sweet-regrets/" target="_blank">here</a>.
fr: Plateforme web d'écoute et de partage de musiques. Projet rassemblant toute la promotion (33 étudiants) 2014/2015 du master Génie de l'Informatique Logicielle divisée en équipes de 5/6 étudiants. Durant ce projet j'ai été améné à superviser deux équipes de 5/6 étudiants, former la promotion à git(présentation disponible <a href="http://blog.juanwolf.fr/media/Formation%%20Git.pdf">ici</a>), installer une usine logicielle constituée de Jenkins, Maven, Tomcat, Nexus et un serveur Apache, développer un service (Service Checker) pour gérer les différents services disponibles au sein d'un tomcat. Service réalisé avec Valentin Jouanigot, développer une librairie SFTP en java avec jSch, développer des scripts d'automatisation des tâches récurrentes (telles que merge des branches de développement, construction de tous les sous projets maven, passage de l'environnement de développement à l'environnement de production), gérer les serveurs mis à disposition par l'université de Rouen et assurer la stabilité de DRUMS au sein de ses serveurs.Retour d'expérience du projet disponible ici : <a href="https://blog.juanwolf.fr/2015/3/drums-mes-tendres-regrets/" target="">https://blog.juanwolf.fr/2015/3/drums-mes-tendres-regrets/</a>

source: Technologies used: Jenkins, nexus, apache, tomcat 7, maven, spring, angular js, html5, css3.
fr: Technologies utilisées: Jenkins, nexus, apache, tomcat 7, maven, spring, angular js, html5, css3.

source: A web platform for chessboard games. It was a six month project assigned as part of the project management module. I was given the task to develop the node.js module and administrate the distant server provided by the university. Role: System administrator and technical chief.
fr: Plateforme web de jeux de société. Ce projet a été réalisé durant toute l'année de master 1 où nous avons utilisés les enseignements de l'unité 'gestion de projets'. J'ai été affecté au développement du module node.js pour le chat et la gestion des jeux en temps réel et d'administrer le serveur fourni par l'université de Rouen qui nous servait d'environnement de production. Rôle: Administrateur système et responsable technique.

source: Technologies used: code igniter, PHP 5, HTML5, CSS3, node.js, jQuery 1.9, bash
fr: Technologies utilisées: Code Igniter, PHP 5, HTML5, CSS3, JS, node.js, jQuery 1.9, bash.

source: A server that provides XML resumes. Based on a REST architecture, only the GET and PUT are implemented.
fr: Serveur qui produit des fichiers XML contenant des CV. Ce serveur est basé sur une architecture REST mais seulement le GET et le PUT y est implémenté.

source: Technologies used: java 7, spring, git
fr: Technologies utilisées: Java 7, Spring, Git

source: A Phonegap application that uses the XML REST Server. Only the GET and PUT methods are implemented.
fr: Application Phonegap qui utilise le serveur produisant des CV en XML. Seul le GET et le PUT sont implémentés.

source: Technologies used: phonegap, HTML5, CSS3, jQuery 2.0, ajax, jQuery Mobile 1.4.2
fr: Technologies utilisées : Phonegap, HTML5, CSS3, JQuery 2.0, Ajax, JQuery Mobile 1.4.2

source: A swing application about the rush hour game (<a href='https://www.jeu.fr/jeu/rush_hour_2' target='_blank'>A web version of the game</a>).
fr: Application swing modélisant le jeu Rush Hour qui est un jeu logique (similaire au taquin) (<a href='https://www.jeu.fr/'>Une version web du jeu Rush Hour)</a>.

source: Technologies used: swing, java 6
fr: Technologies utilisées: Swing, Java 6

source: Web calendar
fr: Calendrier Web

source: A web application that gives the user the ability to manage events and customize their own calendar.
fr: Application web qui donne à l'utilisateur la possibilité de gérer les événements au sein d'un calendrier, mais aussi de personnaliser son propre calendrier.

source: Technologies used: XHTML, CSS 2, javascript, PHP 5, MySQL, ajax, jQuery 1.9
fr: Technologies utilisées : XHTML, CSS 2, JS, PHP 5, MySQL, Ajax, JQuery 1.9

source: What can I use ?
fr: Que sais-je utiliser ?

source: (Ranked by preference of what I enjoy using)
fr: (Triés par préférence d'utilisation)

source: Databases
fr: Bases de données

source: Servers
fr: Serveurs

source: What languages can I speak?
fr: Quelles langues je peux parler ?

source: French
fr: Français

source: Native language
fr: Langue maternelle

source: English
fr: Anglais

source: Conversational and professionnal skills
fr: Compétences professionnelles

source: Spanish
fr: Espagnol

source: What do I enjoy doing?
fr: Ce que j'aime faire ?

source: Music (Guitar, Ukulele, MAO)
fr: Musique (Guitare, Ukulele, MAO)

source: Video games (RPG, FPS)
fr: Jeux vidéo (RPG, FPS, sandbox, action, aventure)

source: Sport (Tennis, Football, Running 5k, 10k)
fr: Sports (Tennis, football, course à pieds 5km, 10km)

source: Experimenting with and using new technologies
fr: Veille technologique
